app/controllers/reservations_controller.rb

    def set_reservation
        @reservation = Reservation.find(params[:id])
---
SELECT `reservations`.* FROM `reservations` WHERE `reservations`.`id` = 980190962 LIMIT 1